fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_КоличествоДнейОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	 ОтпускаСотрудниковПриОкончанииРедактированияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтпускаСотрудниковПриОкончанииРедактированияНаСервере() 
	
       	Для каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл 
			
		СтрокаТЧ.ПревышеноДнейОтпуска = Ложь;
		
		Отбор = Новый Структура("Сотрудник",СтрокаТЧ.Сотрудник);
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(Отбор);
		
		ОписаниеТиповСотрудник = Новый ОписаниеТипов("СправочникСсылка.ВКМ_ФизическиеЛица"); 
		ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
				
		ТЗДнейОтпуска = Новый ТаблицаЗначений;
		ТЗДнейОтпуска.Колонки.Добавить("НомерСтроки",ОписаниеТиповЧисло);
		ТЗДнейОтпуска.Колонки.Добавить("Сотрудник",ОписаниеТиповСотрудник);
		ТЗДнейОтпуска.Колонки.Добавить("РазницаДней", ОписаниеТиповЧисло); 
		
		Для каждого Значение Из НайденныеСтроки Цикл 
			РазницаДней = ((НачалоДня(Значение.ДатаОкончания) - НачалоДня(Значение.ДатаНачала)) / (60 * 60 * 24)); 
			СтрокаТЗ = ТЗДнейОтпуска.Добавить();
			СтрокаТЗ.НомерСтроки = Значение.НомерСтроки;
			СтрокаТЗ.Сотрудник = Значение.Сотрудник;
			СтрокаТЗ.РазницаДней = РазницаДней; 
		КонецЦикла;
		
		ЗначениеКолонкиРазницаДней = ТЗДнейОтпуска.Итог("РазницаДней");
		
		Если ЗначениеКолонкиРазницаДней > 28 Тогда
			РазницаДнейОтпуска = ЗначениеКолонкиРазницаДней - 28;
			СтрокаТЧ.ПревышеноДнейОтпуска = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("У сотрудник %1, номер строки %2 превышен лимит отпускных дней на %3", 
					СтрокаТЧ.Сотрудник, СтрокаТЧ.НомерСтроки, РазницаДнейОтпуска);
			Сообщение.Сообщить(); 
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	АдресВХранилище = ПоместитьДанныеВХранилище();
    ПараметрыПодбора = Новый Структура("АдресДокумента, Год", АдресВХранилище, Объект.Год);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",ПараметрыПодбора,ЭтотОбъект);

КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
КонецФункции
 
#КонецОбласти
